INSERT INTO predaking.skill (name,`desc`,is_judge,is_lock) VALUES
	 ('占星','进场后，显示对方手牌',0,0),
	 ('协作','相邻友军进攻后，自身发动进攻',1,1),
	 ('警戒','率先对放置自己相邻的敌军发动进攻',0,1),
	 ('陷阵','自身将敌军翻面时，己方手牌点数增加1',0,1),
	 ('酣战','被自己翻面的敌方单位将继续进攻',0,0),
	 ('勇猛','每次进攻后自身点数增加1',1,0),
	 ('突袭','进场后，若自身相邻仅有1名敌方单位，则与其交换位置',0,0),
	 ('强弓','可以隔着1名友军或者1个空格对敌方进行攻击',0,0),
	 ('洞察','进攻时，与敌军最小点数相比',1,0),
	 ('护卫','相邻友军被翻面后，尝试将其翻回',1,1);
INSERT INTO predaking.skill (name,`desc`,is_judge,is_lock) VALUES
	 ('睚眦必报','将自己翻面的单位也会被翻面',1,0),
	 ('先驱','进场后，补1张牌',0,0),
	 ('反骨','相邻友军被翻面时，跟随其翻面',0,0),
	 ('鼓舞','置于相邻的友军点数增加1',0,0),
	 ('压制','置于相邻的敌军点数降低1',0,0),
	 ('遗志','每次被翻面，己方手牌点数增加1',1,0),
	 ('业火','进场后，敌方场上卡牌点数降低1',0,0),
	 ('机巧','敌方进场置于相邻时，则退后一格',1,0),
	 ('谦逊','与敌军比点时，改为点数小的赢',0,0),
	 ('斩袭','攻击时且将被攻击单位推后一格',0,1);
INSERT INTO predaking.skill (name,`desc`,is_judge,is_lock) VALUES
	 ('幕府','若有友军相邻，则抵消1次翻面（每回合1次）',1,1),
	 ('幕僚','进场后，相邻友军点数增加1，补1张卡牌点数增加1，并1张牌',0,0),
	 ('鬼谋','进场后，相邻友军点数增加1，并全随机1至场上相邻友军发起攻击',0,0),
	 ('智谋','任意单位置于相邻时，贾诩随机取1空格重新进场',0,1),
	 ('历战','友军进场置于相邻时，自己发起进攻',1,0),
	 ('缔盟','友军首次置于相邻后，则互相换位并攻击',1,0),
	 ('斩除','移除被自己翻面的武将，补一张手牌',0,0),
	 ('倾国','可以抵消1次被翻面',0,0),
	 ('鬼才','被翻面时，将自身移除',1,0),
	 ('补给','首个敌军进场置于相邻时，补1张牌',0,0);
